{"events":[{"name":"Ferrari Birthday Cruise-In","summary":"Come see some of the fastest, rarest and most beloved Ferraris of all time. The Petersen will celebrate Enzo Ferrari’s birthday by having cruise-in on the third floor parking structure of the museum. We invite all Ferrari enthusiasts to participate in the car show and contest. Awards will be given for Best-In-Show, Petersen Perfection, and People’s Choice. The most historically authentic car will receive The Petersen Perfection Award.","location":"Petersen Automotive Museum","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/enzo-ferrari-birthday-cruise","date":"February 26","type":" / Museums & Galleries      "},{"name":"How Would You Defeat Racism?","summary":"One photograph of Black Panther Party leader Huey Newton seated on a throne-like chair has inspired many people, including artist Kevin Beasley. Decorate a throne with others, take a seat, and declare how you would defeat racism in your world.","location":"Hammer Museum","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/art-without-walls-how-would-you-defeat-racism","date":"February 26","type":" / Museums & Galleries      "},{"name":"Los Angeles Lakers vs. San Antonio Spurs","summary":"Los Angeles Lakers vs. San Antonio Spurs","location":"STAPLES Center","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/los-angeles-lakers-vs-san-antonio-spurs-9","date":"February 26","type":" / Sports      "},{"name":"Leimert Park Art Walk: February","summary":"The Leimert Park Art Walk is a free self-guided visual and performance art experience that happens on the last Sunday of every month.","location":"Leimert Park","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/leimert-park-art-walk-february","date":"February 26","type":" / Festivals      "},{"name":"Exhibition Lecture: The Outsider (or Uninitiated) Usually Sees Through the Nose","summary":"In conjunction with the exhibition The Inner Eye: Vision and Transcendence in African Arts, Rowland O. Abiodun, John C. Newton Professor of Art and the History of Art and Black Studies at Amherst College, speaks on the Inner Eye (Ojú-Inú), which refers to insight, a special kind of understanding of a person, thing, or situation, not usually derived from an obvious source. It is the intellect with which one perceives the individualized form, color, substance, outline, rhythm, and harmony of a subject. This sensibility is extremely important if the artist is to capture accurately the essential identity, character, and function of his subject.","location":"","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/exhibition-lecture-outsider-or-uninitiated-usually-sees-through-nose","date":"February 26","type":" / Museums & Galleries "},{"name":"Reggie Watts in Conversation w","summary":"Event: Reggie Watts in Conversation with Anthony Valadez","location":"Central Library, Mark Taper Auditorium","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/reggie-watts-conversation-anthony-valadez","date":"February 26","type":" / Arts & Theater      "},{"name":"Joel Berg discusses and signs America, We Need to Talk: A Self-Help Book for the Nation","summary":"How did we get here, America? How did our relationship get so broken? And where do we go now? Starting with the premise that Americans' most important relationship is with their nation, Joel Berg’s second book, America We Need to Talk: A Self-Help Book for the Nation, makes a case for how we must both stop blaming the nation’s problems solely on the politicians or the system and take personal responsibility to solve them. Written as both a hilarious parody of relationship and self-help books and a deadly serious analysis of the nation's political and economic dysfunction, the book dissects how Donald Trump and other Republicans won over white, working-class voters, and includes a concrete plan to win them back, and well as a broader roadmap for reducing poverty, bolstering the middle class, and powering an overall progressive resurgence.   As an acclaimed author, a frequent voice in the national media, and the outspoken CEO of the nonprofit group Hunger Free America, Joel Berg is a respected international leader in the fields of hunger, poverty, food, and US politics. Through his biting critique, clear-headed prescriptions, and amusing charts this book shows how average Joes and Janes can channel their anger at our hobbled government into concrete actions that will fix our democracy, make our economy work for everyone, and restore our stature in the world as a beacon of freedom, diversity, and hope. The American people are in it for the long haul, and, as in all relationships, both sides must recognize their issues and work together to fix them. This book will do more than offer comfort for sobbing progressives it will show the path to redemption. (Seven Stories Press)","location":"Book Soup","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/joel-berg-discusses-and-signs-america-we-need-talk-self-help-book-nation","date":"February 26","type":" / Miscellaneous      "},{"name":"THE 89TH ACADEMY AWARDS","summary":"The 89th Academy Awards, hosted by Jimmy Kimmel, will take place at Hollywood's Dolby Theatre.","location":"Dolby Theatre","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/89th-academy-awards","date":"February 26","type":" / Arts & Theater      "},{"name":"Stylistics with Peaches and Herb","summary":"Stylistics with Peaches and Herb","location":"Wiltern Theatre","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/stylistics-peaches-and-herb","date":"February 26","type":" / Music      "},{"name":"Los Angeles Clippers vs. Charlotte Hornets","summary":"Los Angeles Clippers vs. Charlotte Hornets","location":"STAPLES Center","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/los-angeles-clippers-vs-charlotte-hornets-1","date":"February 26","type":" / Sports      "},{"name":"Venice Baroque Orchestra","summary":"The Venice Baroque Orchestra, one of Europe’s finest period instrument ensembles, returns with a program featuring Vivaldi’s vividly programmatic Four Seasons concertos, with the zesty, challenging solos played by rising Scottish star Nicola Benedetti.","location":"Walt Disney Concert Hall","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/venice-baroque-orchestra-2","date":"February 26","type":" / Music      "},{"name":"Torrance Antique Street Faire","summary":" ","location":"Downtown Torrance","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/torrance-antique-street-faire-8","date":"February 26","type":" / Miscellaneous      "},{"name":"Milk + Bookies Story Time","summary":"Milk+Bookies is a charity that helps get books to kids who otherwise wouldn’t be able to afford them. They accomplish this a number of ways. Among them, local “book raisers,” fundraisers anyone can host, and their annual fundraiser, “Story Time Celebration,” which is held every spring in Los Angeles. This year our Story Time Celebration is taking place on February 26th from 11 am to 2 pm at HD Buttercup in Culver City.","location":"HD Buttercup Culver City","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/milk-bookies-8th-annual-story-time-celebration","date":"February 26","type":" / Family      "},{"name":"Remember WENN","summary":"At WENN in Pittsburgh, it's the early years of World War II and each day at this small station it's one thing after the other as the small cast and crew struggle to perform day-to-day programming on a shoestring budget. They're not afraid to try anything new, be it from a new line in detective stories to the romance of a bachelor talk show. The performers include Mackie Bloom, the \"Man of a Thousand Voices;\" Hilary Booth, the sharp-tongued ex-Broadway actress, and her husband Jeffrey Singer, he of the roving eye, plus curiously silent special effects master Mr. Foley. ","location":"The Actors Company LA","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/remember-wenn-1","date":"February 26","type":" / Arts & Theater      "},{"name":"Children's Reading Hour, FREE!","summary":"Geared toward children ages 2-10, bilingual, parents are welcome, and it's FREE!","location":"Libros Schimbros: Lending Library","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/childrens-reading-hour-free-0","date":"February 26","type":" / Family      "},{"name":"Formation of tektites","summary":" ","location":"UCLA Meteorite Gallery","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/formation-tektites-thermal-plumes-no-craters-required","date":"February 26","type":" / Museums & Galleries      "},{"name":"Caltech Theater Presents","summary":"Theater Arts Caltech, a diverse group of Caltech undergrads/grads/staff/alums, JPL and associated community members, dives headfirst into the Sondheim revival with a contemporary spin on the 1970 musical Company, directed by Brian Brophy. This frank examination on the nature of relationships, marriage and the state of solitude in our post-modern era introduces us to Bobby, an urbanite living in New York City who, on the eve of a seminal birthday, begins to see through the cracks in the seemingly perfect relationships around him and asks plaintively: “What do you get?”.        The role of the charming misfit Bobby is played with extraordinary sensitivity by Steve Markham, a PhD student in Geological and Planetary Sciences at Caltech, while the married couples, former flames and casual flings that constitute Bobby’s trove of emotional spirit guides are brought to life by the talented band of Theater Arts Caltech players. Choreographer Dr. Crystal Dilworth dynamizes the story with her trademark lyrical intensity and humor in spectacular dance sequences, while musical director Scott Lehmkuhl, a long-time core member of the Los Angeles Master Chorale conducts a nine-piece orchestra through some of Sondheim’s most memorable, and intricate works, such as “Company”, “Not Getting Married Today”, “Another Hundred People”, “Ladies Who Lunch”, and “Being Alive”.        “This particular Sondheim sets itself apart in that it has a darker tonality and explores more realism with characters and situations,” said Lehmkuhl. Written in 1969 by Sondheim and George Furth, this musical “continues to capture the range of desire by humans in need of contact with each other,” according to Brian Brophy, head of Theater Arts at Caltech. “Many of the early critiques thrown at Company refer to Bobby as “being in the closet”.  This production dispels that notion and disrupts the heteronormative universe by democratizing same-sex unions in the casting of the five couples. These casting decisions reflect the diversity of our Caltech community and offer a glimpse into the continued struggle to find our most truly authentic self.”        WHERE:    Performances begin February 24 in Ramo Auditorium on the Caltech campus and tickets can be purchased in advance through the Caltech Ticket Office at (626) 395-4652 or visit tacit.caltech.edu for more information.  Prices are as follows:  $5 students, $9 staff/faculty/jpl and $18 general admission.        WHEN:    February 24 - 26, 2017    Fri, Sat @7:30 PM    Sun @2:30        March 2-4    Thurs, Fri @7:30    Sat @2:30        This event is presented by Theater Arts Caltech with support from Caltech Student Affairs, TIAA, the Moore Hufstedler Fund and the many generous supporters of live theater at Caltech.    ###        CONTACT:  Cindy De Mesa    Caltech Performing and Visual Arts    (626) 395-3295    [email protected]/* <![CDATA[ */!function(t,e,r,n,c,a,p){try{t=document.currentScript||function(){for(t=document.getElementsByTagName('script'),e=t.length;e--;)if(t[e].getAttribute('data-cfhash'))return t[e]}();if(t&&(c=t.previousSibling)){p=t.parentNode;if(a=c.getAttribute('data-cfemail')){for(e='',r='0x'+a.substr(0,2)|0,n=2;a.length-n;n+=2)e+='%'+('0'+('0x'+a.substr(n,2)^r).toString(16)).slice(-2);p.replaceChild(document.createTextNode(decodeURIComponent(e)),c)}p.removeChild(t)}}catch(u){}}()/* ]]> */","location":"Ramo Auditorium","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/caltech-theater-presents-company-stephen-sondheim-3","date":"February 26","type":" / Arts & Theater      "},{"name":"Emeralde at the Pops","summary":" ","location":"Hart High Auditorium","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/emeralde-pops","date":"February 26","type":" / Music      "},{"name":"Santa Clarita Philharmonic","summary":"The Santa Clarita Philharmonic presents its annual \"pops\" concert featuring music from stage and screen and a special perfromance of the contemorary pop duo of Emeralde. ","location":"Hart High School Auditorium","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/santa-clarita-philharmonic","date":"February 26","type":" / Music      "},{"name":"A DeLUSIONAL Affair","summary":" ","location":"Santa Monica Playhouse Main Stage","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/delusional-affair-%E2%80%93-new-comedy-albert-james-kallis-%E2%80%93-just-when-you-thought-your-0","date":"February 26-March 26","type":" / Arts & Theater      "},{"name":"Oscar Party","summary":"Shade Hotel, Manhattan Beach’s only luxury boutique hotel will bring the excitement of Hollywood’s Dolby Theatre to South Bay with a black-tie Oscars Viewing Party","location":"Shade HOtel","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/oscar-party","date":"February 26","type":" / Arts & Theater      "},{"name":"Award Show VIP Viewing Party a","summary":"On February 26, 2017, The Tuck Room Tavern is hosting the most stylish Academy Awards viewing party in Los Angeles and you're invited! ","location":"The Tuck Room Tavern","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/award-show-vip-viewing-party-tuck-room-tavern-red-carpet-dining-experience","date":"February 26","type":" / Film, TV & Radio      "},{"name":"LACO 5: Haydn in London","summary":"LACO 5: Haydn in London","location":"Royce Hall - UCLA","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/laco-5-haydn-london","date":"February 26","type":" / Arts, Theatre & Comedy      "},{"name":"On-Site: North Hollywood - John McLaughlin: Geometric Abstract Paintings","summary":"John McLaughlin (1898–1976) created a focused body of geometric paintings that have no connection to everyday experience based on the Japanese philosophy known as ma, the emptiness that exists between two forms. His paintings do not tell a story or depict anything recognizable, and are the opposite of representational art; instead he used colors and geometric shapes to highlight the empty spaces between the geometric planes.","location":"North Hollywood Amelia Earhart Regional Library","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/site-north-hollywood-john-mclaughlin-geometric-abstract-paintings","date":"February 27","type":" / Museums & Galleries      "},{"name":"Suicide Silence Album Signing","summary":"Suicide Silence celebrates their new self-titled album (out 2/24)  on Nuclear Blast Records. Purchase your copy in-store at Amoeba Hollywood to attend this special signing event! Space is limited.Catch them live at The Observatory in Santa Ana on 2/24.Suicide Silence redefines, refines and brilliantly sharpens the purpose of the band, a group whose music has been integral to the personal daily empowerment of many of its diehard fans and absolutely of vital consequence to the survival of the guys in the band.On their fifth album, Chris Garza (guitar), Mark Heylmun (guitar), Dan Kenny (bass), Alex Lopez (drums) and Eddie Hermida (vocals)  attack the next chapter of their creative expression together with purpose, complacency-smashing courage, and decisiveness. Suicide Silence enlisted producer Ross Robinson, (Slipknot, Korn, At The Drive-In, Sepultura, Glassjaw, and From First To Last) and mixed by Joe Barresi,  (Tool, Queens Of The Stone Age, Slipknot, Fu Manchu, Kyuss, and Bad Religion).  The result is a record that’s simultaneously raw and intimate, brutal and powerful, from the ripper attack of album opener “Doris,” with a jarring sound that puts the listener right inside the room with Robinson and the band, to the haunting melancholy of “Conformity” and the soul searching, epic adventure of “Silence” and “The Zero.”The band’s continued legacy cemented and secure with their previous four records, Suicide Silence have endeavored to leave their mark on heavy metal with a diverse catalog demonstrative of the totality of who they are as people. Album five is their most victorious triumph by far, but it’s by no means their only jaw-dropping accomplishment.2014’s You Can’t Stop Me served as a simultaneous introduction to Hermida, as well as a celebration of the brotherhood the band shared with his late predecessor, Mitch Lucker. Suicide Silence fans demonstrated their fierce loyalty and unwavering support when album number four emerged, putting it in the Billboard 200’s Top 20. The industry followed suit; Sirius XM’s Liquid Metal played it more than any other album in 2014.The tight-knit band’s mash-up of death metal, grind and time-signature bending dissonance with structured, focused and undeniable grooves unquestionably shaped and led the emerging “deathcore” subgenre from the arrival of their 2007 debut, The Cleansing. Suicide Silence was named “Best New Talent” at the Revolver Golden Gods Awards and had already dominated the Rockstar Mayhem touring festival by the time 2009’s No Time To Bleed broke into the Billboard Top 40. “Wake Up” and “Lifted” became underground classics, as Suicide Silence transcended the subgenre they helped define and became peers with bands they’d grown up listening to as kids in California.Produced by Steve Evetts (The Dillinger Escape Plan, Every Time I Die, Sepultura) and mixed by Zeuss (Rob Zombie, Queensrÿche, Hatebreed), 2011’s The Black Crown was the full realization of everything Suicide Silence stood for and vehemently stood against.Suddenly, the man who popularized the “You Only Live Once” phrase in the heavy music community left the world behind unexpectedly and much too soon to fathom. Lucker was killed in a motorcycle accident on Halloween Night, 2012. Two months later, Suicide Silence took the stage without Mitch for the first time, playing an emotional and career spanning set in memorial to their late singer, with Hermida and frontmen from bands like Mudvayne, Lamb Of God, and Machine Head. An understanding and supportive audience responded enthusiastically to the October 2013 announcement that Suicide Silence would officially continue with Hermida, the only man considered for the job.  The new Suicide Silence made their live debut at Australia’s Soundwave in 2014. The year included a return to Rockstar Mayhem, a co-headlining tour with Black Dahlia Murder, a sold out run across Europe and a performance at Slipknot’s Knotfest. As Suicide Silence found new life and empowerment in the compositions boiling within You Can’t Stop Me, so did their enduringly strong army of supporters, both old and new, who shared in that empowerment.As evidenced most defiantly and definitively with the self-titled fifth album by Suicide Silence, the best in the creative arts is born from pain, birthed in truth, drawn from harrowing life experience. It mines the inner depths of the soul to snatch authentic beauty from the jaws of an otherwise certain death.","location":"Amoeba Hollywood","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/suicide-silence-album-signing","date":"February 27","type":" / Music      "},{"name":"Member Monday: Picasso and Rivera and more","summary":"Member Mondays are extended evening hours for select exhibitions, for LACMA members only.","location":"","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/member-monday-picasso-and-rivera-and-more-0","date":"February 27","type":" / Museums & Galleries "},{"name":"Tim Dorsey discusses and signs Clownfish Blues","summary":"A (Serge A.) Storm is brewing for a cabal of bad guys gaming the Florida state lottery in this insanely funny novel from the maestro of mayhem, Tim Dorsey.  If you’re loud and proud Floridian Serge A. Storms, how do you follow up your very own remake of Easy Rider? You shoot your own \"episodes\" of your favorite classic television show, Route 66!  With Coleman riding shotgun, Serge is rolling down the highway of his dreams in a vintage silver convertible Corvette just like the snazzy car Martin Milner drove. It doesn’t matter that the actual Route 66 didn’t pass through Florida, for Serge discovers that a dozen episodes near the series end were filmed (really!) in his beloved home state. So for Serge and the always toked and stoked Coleman, the Sunshine State is all the road you need to get your kicks.","location":"Book Soup","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/tim-dorsey-discusses-and-signs-clownfish-blues","date":"February 27","type":" / Miscellaneous      "},{"name":"Flying “the Hump” in World War","summary":"  Normal\n  0","location":"Crowell Public Library","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/flying-%E2%80%9C-hump%E2%80%9D-world-war-ii","date":"February 27","type":" / Educational      "},{"name":"Aloud at Central Library: An Evening with George Saunders","summary":"In his long-awaited first novel, American master George Saunders delivers his most original, transcendent, and moving work yet. Lincoln in the Bardo places the reader in a Georgetown cemetery on a rainy February night in 1862. From that seed of historical truth, the story spins into a metaphysical realm as a grief-stricken President Lincoln—one year into the Civil War—mourns the loss of his son Willie. Through a thrilling experimental form narrated by a chorus of voices, a blend of history and philosophy, a cast of characters living and dead, Saunders grapples with the timeless question: How can we continue to love when everything we love must eventually be lost? Join us for a special evening as Saunders takes the stage to discuss this astonishing feat of imagination with award-winning author Anthony Marra, known for his transcendent stories of love and war.","location":"Los Angeles Central Library's Mark Taper Auditorium","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/aloud-central-library-evening-george-saunders","date":"February 27","type":" / Educational      "},{"name":"The End(s) of Remembrance: Two","summary":" ","location":"James Bridges Theater, UCLA Campus","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/ends-remembrance-two-films-holocaust-memory-sergei-loznitsa","date":"February 27","type":" / Arts & Theater      "},{"name":"Summer Moon","summary":"The brainchild of The Strokes' bassist, Nikolai Fraiture, Summer Moon is a music and arts collective currently featuring Stephen Perkins of Jane's Addiction, Camila Grey of Uh Huh Her and Noah Harmon of The Airborne Toxic Event.","location":"","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/summer-moon","date":"February 27","type":" / Comedy "},{"name":"Jens Lekman","summary":"Jens Lekman, born and reared in Gothenburg, Sweden, is a songwriter, adventurer and retired bingo hall employee. Traveling our globe as a wide open receptor of all it has to offer, Lekman repurposes for his own oeuvre the world's great, lost pop hooks of past and present. He breathes into them his droll senses of humor, romance and melody and gives them a newfound buoyancy. Since his 2004 trifecta of EPs (Maples Leaves, Rocky Dennis in Heaven, You Are the Light) and right on through his acclaimed 2007 full-length, Night Falls Over Kortedala, Lekman has made hopeless romantics of us all. In a musical language that has roots in the work of Arthur Russell, The Magnetic Fields, Calvin Johnson and Modern Lovers, Lekman's songs serve as a reminder to look closer at the world around us, to appreciate the beauty when it's both in and out of context; at its most heartbreaking, its most loving, and its most absurd.","location":"Teragram Ballroom","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/jens-lekman","date":"February 27","type":" / Music      "},{"name":"Marty Stuart","summary":"With legends like George Jones, Johnny Cash and Merle Haggard all passed on, country music purists often echo the question Jones himself asked: \"Who's going to fill their shoes?\" The answer, in part, is Marty Stuart. While he's too gracious to admit it himself, the GRAMMY-winning singer, songwriter and musician is living, breathing country-music history. He's played alongside the masters, from Cash to Lester Flatt, who discovered him; been a worldwide ambassador for Nashville, Bakersfield and points in between; and safeguarded country's most valuable traditions and physical artifacts. But most importantly, Stuart continues to record and release keenly relevant music, records that honor country's rich legacy while advancing it into the future. Way Out West (due March 10 on Superlatone Records), his 18th studio album, hits both of those marks. Produced by Mike Campbell (of Tom Petty and the Heartbreakers), the album is a cinematic tour-de-force, an exhilarating musical journey through the California desert that solidifies Stuart as a truly visionary artist. Opening with a Native American prayer, a nod to Stuart's affinity for the indigenous people, particularly the Lakota, Way Out West transports the listener to the lonely but magical American West. It is, in its own way, musical peyote. Growing up in Philadelphia, Mississippi, Stuart was taken by the mystique of the Golden State: the culture, the movies and especially the music. As such, the album could only be recorded there, and Stuart, with his longtime backing band the Fabulous Superlatives — made up of guitarist Kenny Vaughan, drummer Harry Stinson and new member, bassist Chris Scruggs — recorded half of the album at Capitol Records and the rest at Campbell's M.C. Studio, a gritty space with a vibe all its own. The result: a 15-song collection of newly written originals, instrumentals and rare covers like the Benny Goodman-penned \"Air Mail Special,\" and \"Lost on the Desert,\" once recorded by Cash. Ahead of the album's release, the GRAMMY Museum welcomes Marty Stuart to the Clive Davis Theater for an intimate discussion on his forthcoming California-inspired album and special perfo","location":"GRAMMY Museum","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/marty-stuart","date":"February 27","type":" / Music      "},{"name":"Bill Burr & Friends (SOLD OUT)","summary":"Comedian Bill Burr plays a sold-out show at Largo.","location":"LARGO at the CORONET","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/bill-burr-friends-sold-out","date":"February 27","type":" / Comedy      "},{"name":"A DeLUSIONAL Affair","summary":" ","location":"Santa Monica Playhouse Main Stage","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/delusional-affair-%E2%80%93-new-comedy-albert-james-kallis-%E2%80%93-just-when-you-thought-your-0","date":"February 26-March 26","type":" / Arts & Theater      "},{"name":"InterContinental, Los Angeles","summary":" ","location":"Los Angeles Convention Center","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/intercontinental-los-angeles-downtown-job-fair","date":"February 27-March 2","type":" / Miscellaneous      "},{"name":"Free Junior Golf Lessons AG","summary":"2017 Free Junior After School Golf Lessons at select Los Angeles County Golf Properties. ","location":"Altadena Golf Course","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/free-junior-golf-lessons-ag","date":"February 27-March 3","type":" / Sports      "},{"name":"Fox & Bones @ Republic of Pie","summary":"Fox and Bones is a Portland, OR-based conceptual folk duo currently on tour in the US supporting their LP \"The Remarkable Adventures of Fox and Bones\". Armed with lush two-part harmonies, soulful melodies and complex lyrics, a Fox and Bones show is intimate, heartwarming and quirky: an experience not to be missed.","location":"Republic Of Pie","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/fox-and-bones-republic-pie","date":"February 27","type":" / Music      "},{"name":"An Evening with George Saunder","summary":"In his long-awaited first novel, American master George Saunders delivers his most original, transcendent, and moving work yet. Lincoln in the Bardo places the reader in a Georgetown cemetery on a rainy February night in 1862. From that seed of historical truth, the story spins into a metaphysical realm as a grief-stricken President Lincoln—one year into the Civil War—mourns the loss of his son Willie. Through a thrilling experimental form narrated by a chorus of voices, a blend of history and philosophy, a cast of characters living and dead, Saunders grapples with the timeless question: How can we continue to love when everything we love must eventually be lost? Join us for a special evening as Saunders takes the stage to discuss this astonishing feat of imagination with award-winning author Anthony Marra, known for his transcending stories of love and war.","location":"The Writers Guild Theater, 135 South Doheny Drive, Beverly Hills, Calif.","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/evening-george-saunders","date":"February 27","type":" / Arts & Theater      "},{"name":"WIN AT LIFE - Official Launch","summary":"Sean Brandon Spector's WIN AT LIFE monthly event series is coming to Los Angeles wit ha kick off launch party on Monday, February 27, 2017 in support of Wings Of Rescue (www.wingsofrescue.org).","location":"Avalon Hollywood","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/win-life-official-launch-party","date":"February 27-28","type":" / Miscellaneous      "},{"name":"Civic Engagement: Democracy in Action","summary":"How does art empower people to share their voices and participate in democracy? artworxLA will partner with the Central Library of Los Angeles and TaskForce to explore the democratic process and citizenship.","location":"Los Angeles Central Library","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/civic-engagement-democracy-action","date":"February 28","type":" / Visual Arts      "},{"name":"Weathering the Storm: Building Resilient Communities","summary":"How do communities come together when faced with a storm? Inspired by global folk stories and Noahs Ark at the Skirball Cultural Center. ","location":"Skirball Cultural Center","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/weathering-storm-building-resilient-communities-0","date":"February 28","type":"      "},{"name":"LABSCAPES: Views Through The M","summary":"“LABSCAPES is an original, fascinating exhibition that changes our perception by reminding us that what we see is not necessarily what we think it is,” said Liebe Geft, Director, Museum of Tolerance. “Melding science and art, the vivid and brilliantly colorful exhibition gives us perspicuous insight into the elemental basis of all life, underscoring the fundamental universality of all living things.”","location":"Museum of Tolerance","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/labscapes-views-through-microscope","date":"February 28","type":" / Museums & Galleries      "},{"name":"Lady Eve","summary":"1941, 84 minutes, 35mm | Directed by Preston Sturges; written by Preston Sturges and screen play based on a story by Monckton Hoffe; with Barbara Stanwyk, Henry Fonda, Charles Coburn, Eugene Pallete, William Demarest, Eric Blore, Melville Cooper, Martha O’Driscoll, Janet Beecher, Robert Greig","location":"LACMA","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/lady-eve-0","date":"February 28","type":" / Museums & Galleries      "},{"name":"Public Tour—Pop for the People: Roy Lichtenstein in L.A.","summary":"Explore the cutting-edge images of Roy Lichtenstein’s Pop Art prints. Discover how his style and technique helped to redefine the midcentury understanding of fine art.","location":"Skirball Center","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/public-tour%E2%80%94pop-people-roy-lichtenstein-la-1","date":"February 28","type":" / Museums & Galleries      "},{"name":"Story Time at Noah’s Ark","summary":"The Autry’s Masters of the American West Art Exhibition and Sale is considered the country’s premier Western art show. Each year, 75 nationally recognized, contemporary Western artists challenge themselves to create and exhibit their very best work. Stylistically and thematically diverse, their works represent the extraordinary range of subject matter that contemporary, historic, and mythic Western experiences inspire.","location":"Autry Museum of the American West","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/masters-american-west-2017","date":"February 28","type":" / Museums & Galleries      "},{"name":"Story Time at Noah’s Ark","summary":"The GRAMMY Museum is pleased to present Count Basie: The King Of Swing, a new exhibit opening on September 29. The exhibit will give visitors a glimpse into the life of the nine-time GRAMMY-winning jazz great through unique artifacts from the private collection of the Count Basie estate.","location":"GRAMMY Museum","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/count-basie-king-swing-1","date":"February 28","type":" / art, live music      "},{"name":"Fat Tuesday at Amoeba","summary":"AMOEBA CELEBRATES ITS NEW ORLEANS LOVE with our annual FAT TUESDAY Mardi Gras celebration – with DJs, and parade with masks, beads and musicians. Bring your horn or percussion and join us for our annual party procession to \"When The Saints...\" and share the cacophonous joy of Fat Tuesday. There will be BEADS and mayhem for the kids and big ones alike.  Amoeba will again donate a portion of the day's proceeds to two charities working to preserve the musical and cultural heritage of New Orleans. ","location":"Amoeba Hollywood","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/fat-tuesday-amoeba-free-all-ages-3","date":"February 28","type":" / Festivals      "},{"name":"Personal Narrative art show","summary":"Opening February 28th, the Annenberg Community Beach House Gallery in Santa Monica will host a group show of contemporary artists who share the experience of being outsiders in Donald Trump's America. In \"Personal Narrative\", curators Diane Williams and Sheli Silverio have brought together artists from diverse backgrounds of immigrant diaspora and gender identity. February 28 - June 4, 2017. Intending to stimulate conversation, inspire creativity and increase understanding of contemporary art in the context of today’s society, the curators have collected works that raise issues and question of both cultural and social consciousness. A panel discussion on May 6th underlines this awareness with a dialogue about process and experiences as 21st century artists living and working in Los Angeles.","location":"Annenberg Community Beach House","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/personal-narrative","date":"February 28","type":" / Arts & Theater      "},{"name":"Screenagers movie","summary":"Through poignant, and unexpectedly funny stories, along with surprising insights from authors and brain scientists, Screenagers reveals how tech time impacts kids’ development and offers solutions on how adults can empower kids to best navigate the digital world and find balance. 70-minutes. ","location":"Raymond Kabbaz Theater","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/screenagers-movie","date":"February 28","type":" / Film, TV & Radio      "},{"name":"Maidan, with director Sergei L","summary":"Sergei Loznitsa is one of the most heralded filmmakers in Europe, but is still little known in America. This is the third night of the series, featuring the award-winning film Maidan. Directed by acclaimed filmmaker Sergei Loznitsa, Maidan chronicles the civil uprising that toppled the government of Ukrainian president Victor Yanukovich and has since developed into an international crisis between Russia and the West. Filmed in stunning long takes, sans commentary, Maidan is a record of a momentous historical event and an extraordinary study of the popular uprising as a social, cultural and philosophical phenomenon.","location":"California Institute of the Arts Bijou Theater","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/maidan-director-sergei-loznitsa-person","date":"February 28","type":" / Arts & Theater      "},{"name":"Los Angeles Lakers vs. Charlotte Hornets","summary":"Los Angeles Lakers vs. Charlotte Hornets","location":"STAPLES Center","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/los-angeles-lakers-vs-charlotte-hornets-0","date":"February 28","type":" / Sports      "},{"name":"Up All Night","summary":"From Award-Winning Choreographer Angela Todaro, watch as Joe Walsh's incredible album, \"Ordinary Average Guy\" is brought to life on stage through dance.","location":"Prospect Theatre","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/all-night","date":"February 28","type":" / Dance      "},{"name":"A DeLUSIONAL Affair","summary":" ","location":"Santa Monica Playhouse Main Stage","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/delusional-affair-%E2%80%93-new-comedy-albert-james-kallis-%E2%80%93-just-when-you-thought-your-0","date":"February 26-March 26","type":" / Arts & Theater      "},{"name":"InterContinental, Los Angeles","summary":" ","location":"Los Angeles Convention Center","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/intercontinental-los-angeles-downtown-job-fair","date":"February 27-March 2","type":" / Miscellaneous      "},{"name":"Free Junior Golf Lessons AG","summary":"2017 Free Junior After School Golf Lessons at select Los Angeles County Golf Properties. ","location":"Altadena Golf Course","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/free-junior-golf-lessons-ag","date":"February 27-March 3","type":" / Sports      "},{"name":"WIN AT LIFE - Official Launch","summary":"Sean Brandon Spector's WIN AT LIFE monthly event series is coming to Los Angeles wit ha kick off launch party on Monday, February 27, 2017 in support of Wings Of Rescue (www.wingsofrescue.org).","location":"Avalon Hollywood","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/win-life-official-launch-party","date":"February 27-28","type":" / Miscellaneous      "},{"name":"Aesop's Fables","summary":"A free public performance of Enrichment Works production of Aesop's Fables.  This breezy two-person musical by Cy Young features the timeless tales of The Tortoise and the Hare, The Boy Who Cried Wolf, and The Fox and the Crow, framed by the story of how Aesop learned his true calling.  Paid for in part by a grant from the Department of Cultural Affairs, Los Angeles.","location":"Hamlin Charter Academy School Auditorium","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/aesops-fables-10","date":"February 28","type":" / Family      "},{"name":"Mardi Gras/ '80's Vinyl Night","summary":" ","location":"The Lincoln","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/mardi-gras-80s-vinyl-night-lincoln","date":"February 28","type":" / Music      "},{"name":"Conversations: Benjamin Madley","summary":"Between 1846 and 1873, California's Indian population plunged from perhaps 150,000 to 30,000. UCLA Professor Benjamin Madley’s An American Genocide: The United States and the California Indian Catastrophe, 1846-1873 details this chilling history, including the involvement of state and federal officials, how taxpayer dollars supported the violence, the Indigenous resistance, who did the killing, and why it constituted genocide.","location":"Hammer Museum","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/conversations-benjamin-madley","date":"February 28","type":" / Museums & Galleries      "},{"name":"The Armenians of the Levant","summary":"Abril Bookstore proudly presents","location":"Abril Bookstore","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/armenians-levant-special-lecture-scott-abramson","date":"February 28","type":" / Educational      "},{"name":"LGBT Night Laugh Factory","summary":"Get ready to LOL for your life as hosts Kelsey Cook and Aidan Park bring you a heaping dose of Comedy Realness!! Featuring the freshest, the hottest and the hands down FIERCEST comics in all the land!","location":"Laugh Factory Hollywood","eventDetail":"http://www.discoverlosangeles.com/what-to-do/events/lgbt-night-laugh-factory","date":"February 28","type":" / Comedy      "}]}