[{"name":"All About Almodóvar","summary":"The Cinefamily stages a complete retrospective of the works of acclaimed Spanish filmmaker Pedro Almodóvar, including all 20 of his films, from 1980's Pepi, Luci, Bom and Other Girls Like Mom to his newest work, Julieta, an adaptation of three Nobel Prize-winnding stories by Alice Munro. Following January's screenings, the Standard, Hollywood will reprise the series with select free screenings, as well as specialty snacks provided by chef Ari Taymor of Alma at the Standard.","location":"The Standard , West Hollywood","locationLink":"https://www.timeout.com/los-angeles/hotels/the-standard","date":"Tuesday February 21 2017 - Tuesday February 28 2017"},{"name":"God Looked Away","summary":"God Looked Away tells the story of playwright-screenwriter-novelist Tennessee Williams. The infamous writer's life and career are at the epicenter of this production, starring Al Pacino and Judith Light. Directed by Robert Allan Ackerman, the show contains adult material.","location":"Pasadena Playhouse , Pasadena","locationLink":"https://www.timeout.com/los-angeles/things-to-do/pasadena-playhouse","date":"Until Sunday March 19 2017"},{"name":"Citizen Science + Suds","summary":"Find out how harnessing the power of people can have a serious impact on science at this beer and lecture series. Each month the Natural History Museum will highlight a different community project, while Angel City Brewery will involve participants in its quest to build the first crowd-sourced beer.","location":"Angel City Brewery , Downtown Arts District","locationLink":"https://www.timeout.com/los-angeles/bars/angel-city-brewery","date":"Thursday March 9 2017 - Thursday April 13 2017"},{"name":"Air + Style","summary":"Witness big air and big music headliners during Shaun White's two-day ski and snowboarding fest at Expo Park. The centerpiece of the extreme sport showcase is a massive ski slope that—as much as we would've loved to see it towering above the rim of the Coliseum—will occupy a field adjacent to the stadium. Snowboarders take to the slopes on both days with sets from Major Lazer, Flume, TV on the Radio, Vince Staples and more.","location":"Exposition Park , USC/Exposition Park","locationLink":"https://www.timeout.com/los-angeles/things-to-do/exposition-park","date":"Sunday February 19 2017"},{"name":"Lady and the Tramp screening","summary":"It’s famous for that spaghetti kiss—a legendary scene that Walt Disney almost cut out. But Lady and the Tramp has many other charming moments: the script evolved out of years of personal pet stories shared by the studio's animal-loving writers and executives. A true labor of love. See it at El Captian around Valentine's Day and you'll be treated to a candlelit dinner before the movie, catered by Miceli’s (sold separately; call 818-845-3110).","location":"El Capitan , Hollywood","locationLink":"https://www.timeout.com/los-angeles/movie-theaters/el-capitan","date":"Sunday February 19 2017"},{"name":"Long Beach Antique Market","summary":"Think of this monthly antiquers' paradise as the Rose Bowl Flea Market of Long Beach. Just as its name suggests, the Long Beach Antique Market is completely chock full of antiques. Whether you're dropping by to furnish your new sunroom, find a specific 1920's steamer trunk, or aimlessly wade through the mammoth selection of vintage clothing, home goods and miscellaneous baubles, the event rarely disappoints.","location":"Long Beach","locationLink":"https://www.timeout.comundefined","date":""},{"name":"AirTalk's FilmWeek Oscar Preview","summary":"Public radio station KPCC's weekly show \"FilmWeek\" records its yearly preview of the Academy Awards in front of a live audience. Gain expert insight into the upcoming Oscars and hear critics debate who's likely to take home an Oscar. Host Larry Mantle will talk to the show's in-house film critic cast. Watch clips on the big screen and hear the pros' opinions on this year's nominated films.","location":"","locationLink":"https://www.timeout.comundefined","date":"Sunday February 19 2017"},{"name":"Tell Your Friends","summary":"Liam McEneaney's beloved stand-up showcase turned concert film has ended its decade-long run in New York, but the show occasionally still surfaces—including for this one-night-only appearance at NerdMelt with Jen Kirkman, Laurie Kilmartin, Cathy Ladman, Josh Fadem and Whitney Melton.","location":"NerdMelt Showroom , Hollywood","locationLink":"https://www.timeout.com/los-angeles/comedy/nerdmelt-showroom","date":"Thursday February 23 2017"},{"name":"Pop-Up Magazine","summary":"Pop-Up Magazine brings together the best kinds of creatives—writers, artists, photographers, filmmakers, puppeteers, the list goes on—and puts them onstage to share and discuss their work. All pieces performed at the show are new and unpublished, either created for the event or as part of a larger ongoing project. This means getting a first look at work from some of the biggest names in fiction, photography, film and more—according to senior editor Pat Walters, \"work everyone else will start hearing about a year from now.\" Also, nothing is recorded, so everything shared is a one-time only creative experience.","location":"The Theatre at Ace Hotel , Downtown Historic Core","locationLink":"https://www.timeout.com/los-angeles/theater/the-theatre-at-ace-hotel","date":"Friday February 24 2017"},{"name":"DocuDay LA","summary":"Catch all of the Oscar-nominated feature-length and short documentaries during this daylong screening evening, with filmmaker Q&As following each feature.","location":"Writers Guild Theater , Beverly Hills","locationLink":"https://www.timeout.com/los-angeles/event-spaces/writers-guild-theater","date":"Saturday February 25 2017"},{"name":"Smorgasburg LA","summary":"Indulge your inner foodie and shopaholic at this weekly food-focused market. The Brooklyn export has landed in the Arts District and become a hotbed of fantastic food and retail vendors, with some that are testing out their dishes before launching a full-blown brick-and-mortar in the city. Bonus: there is plentiful (and free, for two hours!) parking in the nearby parking garage.","location":"ROW DTLA , Downtown","locationLink":"https://www.timeout.com/los-angeles/shopping/row-dtla","date":"Until Sunday December 23 2018"},{"name":"Jason Rhoades: Installations, 1994-2006","summary":"Jason Rhoades grew up in a small town in the foothills outside of Sacramento—an equivalent of L.A.'s heartland. But Rhoades would go on to study in Oakland, San Francisco and L.A. That ideological division would inform his envelope-pushing installations, which often exuberantly approached politics, race, nationality, commerce, sex and gender through the use of neon signs, mechanical parts and readymade objects. Hauser Wirth & Schimmel has collected six such installations from the late artist in his first comprehensive L.A. retrospective. Rhoades would collect readymade objects and mechanical parts, and often work with neon.\r\n \r\n\r\n \r\nJust a quick note: Some subject matter in the exhibition may not be appropriate for children, though not any more so than your typical contemporary art museum.","location":"Hauser Wirth & Schimmel , Downtown Arts District","locationLink":"https://www.timeout.com/los-angeles/art/hauser-wirth-schimmel","date":"Until Sunday May 21 2017"},{"name":"The Oscar-Nominated Short Films screening","summary":"Some Oscar-nominated movies are easy to see. Others aren't exactly playing at your local megaplex. Until now, that is. Take the time to support the little guy by heading to the Nuart to see the Oscar-nominated films in the \"Shorts\" categories—you know, the ones you hear about for the first time on Oscar night that look really good, and you swear you'll Netflix but then can't find and totally forget about and never see. Choose from a program of either live action or animation short nominees—or both—which will be playing for two weeks, and you're sure to gain a leg up on your at-home Academy Awards ballot this year.","location":"Nuart Theatre , West LA","locationLink":"https://www.timeout.com/los-angeles/movie-theaters/nuart-theatre","date":"Until Thursday February 23 2017"},{"name":"Competitive Erotic Fan Fiction","summary":"There are two kinds of people: those who read all three 50 Shades books in one weekend and those who titled their two-star Amazon reviews, \"Did a Teenager Write This???\" If you're part of the latter, you might want to check out Competitive Erotic Fan Fiction. More of a comedy show than a writing workshop, the event features 10 comics reading their own erotica based on improv and audience suggestions.","location":"The Virgil , East Hollywood","locationLink":"https://www.timeout.com/los-angeles/bars/the-virgil","date":"Sunday February 19 2017"},{"name":"#girlgaze: a frame of mind","summary":"Explore the imaginative landscape of young, female and trans-identifying photographers from around the world at #girlgaze: a frame of mind. This mostly digital exhibition at the Annenberg Space for Photography has been largely sourced through social media by Girlgaze, a collective founded by the famed British-born television host, women’s advocate and photographer Amanda de Cadenet.","location":"Annenberg Space for Photography , Century City","locationLink":"https://www.timeout.com/los-angeles/museums-institutions/annenberg-space-for-photography","date":"Until Sunday February 26 2017"},{"name":"LA Art Book Fair","summary":"Printed Matter presents LA Art Book Fair, a unique (and free!) event showcasing artists' books, catalogues, monographs, periodicals and zines. Over 250 international presses, booksellers and independent publishers from twenty-one countries come together to hawk their wordy wares at this not-to-be-missed companion fair to New York's Art Book Fair. Peruse naughty pulp paperbacks, catalogues full of fancy modern art, and books that you don't really \"read\" so much as just admire.","location":"The Geffen Contemporary at MOCA , Little Tokyo","locationLink":"https://www.timeout.com/los-angeles/museums-institutions/the-geffen-contemporary-at-moca","date":"Thursday February 23 2017 - Sunday February 26 2017"},{"name":"Can Television Bring America Together?","summary":"Millions of us may watch the Super Bowl, the Oscars and hit shows, but otherwise the TV landscape can seem just as divided as the people in this country. How can TV work to unite this country? Martin creator John Bowman moderates this Zocalo Public Square event, with panelists including former executive producer of Modern Family Dan O’Shannon, Jane the Virgin showrunner Jennie Snyder Urman and Gloria Calderon Kellett, co-showrunner and executive producer of Netflix’s One Day at a Time.","location":"The Landmark , Westside","locationLink":"https://www.timeout.com/los-angeles/movie-theaters/the-landmark","date":"Tuesday February 21 2017"},{"name":"Time Out and Ace Hotel presents: An Awards Show Watch Party","summary":"Mary Pickford co-founded legendary entertainment studio United Artists and picked up the second ever Academy Award for Best Actress in 1929. So we'd say the Theatre at Ace Hotel (formerly the United Artists Theatre) is a pretty perfect place to sit and watch the Oscars. The theater will be streaming the red carpet arrivals as well as the ceremony broadcast. Creative fancy dress is strongly encouraged.","location":"The Theatre at Ace Hotel , Downtown Historic Core","locationLink":"https://www.timeout.com/los-angeles/theater/the-theatre-at-ace-hotel","date":"Sunday February 26 2017"},{"name":"Long Beach Mardi Gras","summary":"Get into the Mardi Gras spirit with this festival at Long Beach's Shoreline Village. Catch a crew of zydeco bands as well as face painting and balloon artists. Chow down on beignets at the Funnel House and Blue Carousel along with hurricanes, spiked Kool-Aid, jambalaya, gumbo and alligator legs at Louisiana Charlie’s. A parade kicks off on Saturday at 3pm.","location":"Various locations in L.A.","locationLink":"https://www.timeout.com/los-angeles/roving-location/various-locations-in-l-a","date":"Saturday February 25 2017"}]